maoravni/Dev/FECDEV/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/hal/dspi/fsl_dspi_hal.c
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "fsl_dspi_hal.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : dspi_hal_master_init
 * Description   : Configure the DSPI peripheral in master mode.
 * This function will initialize the module to user defined settings and default settings in master
 * mode.  Here is an example demonstrating how to define the dspi_master_config_t structure and call
 * the dspi_hal_master_init function:
 *    dspi_master_config_t dspiConfig;
 *    dspiConfig.isEnabled = false;
 *    dspiConfig.whichCtar = kDspiCtar0;
 *    dspiConfig.bitsPerSec = 0;
 *    dspiConfig.sourceClockInHz = dspiSourceClock;
 *    dspiConfig.isSckContinuous = false;
 *    dspiConfig.whichPcs = kDspiPcs0;
 *    dspiConfig.pcsPolarity = kDspiPcs_ActiveLow;
 *    dspiConfig.masterInSample = kDspiSckToSin_0Clock;
 *    dspiConfig.isModifiedTimingFormatEnabled = false;
 *    dspiConfig.isTxFifoDisabled = false;
 *    dspiConfig.isRxFifoDisabled = false;
 *    dspiConfig.dataConfig.bitsPerFrame = 16;
 *    dspiConfig.dataConfig.clkPolarity = kDspiClockPolarity_ActiveHigh;
 *    dspiConfig.dataConfig.clkPhase = kDspiClockPhase_FirstEdge;
 *    dspiConfig.dataConfig.direction = kDspiMsbFirst;
 *    dspi_hal_master_init(instance, &dspiConfig, calculatedBaudRate);
 *
 *END**************************************************************************/
dspi_status_t dspi_hal_master_init(uint32_t instance, const dspi_master_config_t * config,
                       uint32_t * calculatedBaudRate)
{
    assert(instance < HW_SPI_INSTANCE_COUNT);

    /* Enable or disable the module. */
    /* Note, to enable the module, MDIS must be cleared.  However, the member isEnabled*/
    /* must be true (1) to enable module, hence we negate the value of isEnabled to properly*/
    /* configure the MDIS bit*/
    BW_SPI_MCR_MDIS(instance, ~(config->isEnabled == true));

    /* Configure baud rate if a value is provided.*/
    if (config->bitsPerSec != 0U)
    {
        *calculatedBaudRate = dspi_hal_set_baud(instance, config->whichCtar, config->bitsPerSec,
                                               config->sourceClockInHz);
    }
    else
    {
        *calculatedBaudRate = 0;
    }

    /* Set master or slave mode.*/
    dspi_hal_set_master_slave(instance, kDspiMaster);

    /* Configure data format.*/
    if (dspi_hal_configure_data_format(instance, config->whichCtar, &config->dataConfig)
        != kStatus_DSPI_Success)
    {
        return kStatus_DSPI_InvalidBitCount;
    }

    /* Configure for continuous SCK operation*/
    dspi_hal_configure_continuous_sck(instance, config->isSckContinuous);

    /* Configure for peripheral chip select polarity*/
    dspi_hal_configure_pcs_polarity(instance, config->whichPcs,config->pcsPolarity);

    /* Configure sample point for data in, master mode*/
    dspi_hal_set_datain_samplepoint(instance, config->masterInSample);

    /* Configure for modified timing format*/
    dspi_hal_configure_modified_timing_format(instance, config->isModifiedTimingFormatEnabled);

    /* Configure for fifo operation*/
    dspi_hal_configure_fifos(instance, config->isTxFifoDisabled, config->isRxFifoDisabled);

    /* finally, clear the DSPI CONFIGURATION (DCONF), even though this is cleared in some IPs*/
    /* by default and other bit settings are reserved*/
    HW_SPI_MCR_CLR(instance, BM_SPI_MCR_DCONF);

    return kStatus_DSPI_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : dspi_hal_slave_init
 * Description   : Configure the DSPI peripheral in slave mode.
 * This function initializes the DSPI module for slave mode. Here is an example demonstrating how
 * to define the dspi_slave_config_t structure and call the dspi_hal_slave_init function:
 *    dspi_slave_config_t dspiConfig;
 *    dspiConfig.isEnabled = false;
 *    dspiConfig.isTxFifoDisabled = false;
 *    dspiConfig.isRxFifoDisabled = false;
 *    dspiConfig.dataConfig.bitsPerFrame = 16;
 *    dspiConfig.dataConfig.clkPolarity = kDspiClockPolarity_ActiveHigh;
 *    dspiConfig.dataConfig.clkPhase = kDspiClockPhase_FirstEdge;
 *    dspi_hal_slave_init(instance, &dspiConfig);
 *
 *END**************************************************************************/
dspi_status_t dspi_hal_slave_init(uint32_t instance, const dspi_slave_config_t * config)
{
    assert(instance < HW_SPI_INSTANCE_COUNT);

    /* Enable or disable the module.
     * Note, to enable the module, MDIS must be cleared.  However, the member isEnabled
     * must be true (1) to enable module, hence we negate the value of isEnabled to properly
     * configure the MDIS bit
     */
    BW_SPI_MCR_MDIS(instance, ~(config->isEnabled == true));

