maoravni/Dev/FECDEV/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/hal/dspi/fsl_dspi_hal.c
    /* Set master or slave moe. */
    dspi_hal_set_master_slave(instance, kDspiSlave);

    /* Configure data format. For slave mode, only CTAR0 is available for use */
    if (dspi_hal_configure_data_format(instance, kDspiCtar0, &config->dataConfig)
        != kStatus_DSPI_Success)
    {
        return kStatus_DSPI_InvalidBitCount;
    }

    /* Configure for fifo operation */
    dspi_hal_configure_fifos(instance, config->isTxFifoDisabled, config->isRxFifoDisabled);

    /* finally, clear the DSPI CONFIGURATION (DCONF), even though this is cleared in some IPs
     * by default and other bit settings are reserved
     */
    HW_SPI_MCR_CLR(instance, BM_SPI_MCR_DCONF);

    return kStatus_DSPI_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : dspi_hal_reset
 * Description   : Restore DSPI to reset configuration.
 * This function basically resets all of the DSPI registers to their default setting including
 * disabling the module.
 *
 *END**************************************************************************/
void dspi_hal_reset(uint32_t instance)
{
    assert(instance < HW_SPI_INSTANCE_COUNT);

    /* first, make sure the module is enabled to allow writes to certain registers*/
    dspi_hal_enable(instance);

    /* Halt all transfers*/
    HW_SPI_MCR_WR(instance, BM_SPI_MCR_HALT);

    /* flush the fifos*/
    dspi_hal_flush_fifos(instance, true, true);

    /* set the registers to their default states*/
    /* clear the status bits (write-1-to-clear)*/
    HW_SPI_SR_WR(instance, BM_SPI_SR_TCF | BM_SPI_SR_EOQF | BM_SPI_SR_TFUF | BM_SPI_SR_TFFF |
                           BM_SPI_SR_RFOF | BM_SPI_SR_RFDF);
    HW_SPI_TCR_WR(instance, 0);
    HW_SPI_CTARn_WR(instance, 0, 0); /* CTAR0*/
    HW_SPI_CTARn_WR(instance, 1, 0); /* CTAR1*/
    HW_SPI_RSER_WR(instance, 0);
    /* disable the module*/
    HW_SPI_MCR_WR(instance, BM_SPI_MCR_MDIS | BM_SPI_MCR_HALT);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : dspi_hal_set_baud
 * Description   : Set the DSPI baud rate in bits per second.
 * This function will take in the desired bitsPerSec (baud rate) and will calculate the nearest
 * possible baud rate without exceeding the desired baud rate, and will return the calculated
 * baud rate in bits-per-second. It requires that the caller also provide the frequency of the
 * module source clock (in Hz).
 *
 *END**************************************************************************/
uint32_t dspi_hal_set_baud(uint32_t instance, dspi_ctar_selection_t whichCtar, uint32_t bitsPerSec,
                        uint32_t sourceClockInHz)
{
    assert(instance < HW_SPI_INSTANCE_COUNT);

    /* for master mode configuration, if slave mode detected, return 0*/
    if (HW_SPI_MCR(instance).B.MSTR != 1)
    {
        return 0;
    }

    uint32_t prescaler, bestPrescaler;
    uint32_t scaler, bestScaler;
    uint32_t dbr, bestDbr;
    uint32_t realBaudrate, bestBaudrate;
    uint32_t diff, min_diff;
    uint32_t baudrate = bitsPerSec;

    /* find combination of prescaler and scaler resulting in baudrate closest to the */
    /* requested value */
    min_diff = 0xFFFFFFFFU;
    bestPrescaler = 0;
    bestScaler = 0;
    bestDbr = 1;
    bestBaudrate = 0; /* required to avoid compilation warning */

    /* In all for loops, if min_diff = 0, the exit for loop*/
    for (prescaler = 0; (prescaler < 4) && min_diff; prescaler++)
    {
        for (scaler = 0; (scaler < 16) && min_diff; scaler++)
        {
            for (dbr = 1; (dbr < 3) && min_diff; dbr++)
            {
                realBaudrate = ((sourceClockInHz * dbr) /
                                (s_baudratePrescaler[prescaler] * (s_baudrateScaler[scaler])));

                /* calculate the baud rate difference based on the conditional statement*/
                /* that states that the calculated baud rate must not exceed the desired baud rate*/
                if (baudrate >= realBaudrate)
                {
                    diff = baudrate-realBaudrate;
                    if (min_diff > diff)
                    {
                        /* a better match found */
                        min_diff = diff;
                        bestPrescaler = prescaler;
                        bestScaler = scaler;
                        bestBaudrate = realBaudrate;
                        bestDbr = dbr;
                    }
                }
            }
        }
    }

    uint32_t temp;
    /* write the best dbr, prescalar, and baud rate scalar to the CTAR*/
    temp = HW_SPI_CTARn_RD(instance, whichCtar); /* save register contents*/
    temp &= ~(BM_SPI_CTARn_DBR| BM_SPI_CTARn_PBR | BM_SPI_CTARn_BR);
    temp |= BF_SPI_CTARn_DBR(bestDbr - 1) |
            BF_SPI_CTARn_PBR(bestPrescaler) |
            BF_SPI_CTARn_BR(bestScaler);
    HW_SPI_CTARn_WR(instance, whichCtar, temp);

    /* return the actual calculated baud rate*/
    return bestBaudrate;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : dspi_hal_set_baud_divisors
 * Description   : Configure the baud rate divisors manually.
 * This function allows the caller to manually set the baud rate divisors in the event that
 * these dividers are known and the caller does not wish to call the dspi_hal_set_baud function.
 *
 *END**************************************************************************/
void dspi_hal_set_baud_divisors(uint32_t instance,
                                dspi_ctar_selection_t whichCtar,
                                const dspi_baud_rate_divisors_t * divisors)
{
    assert(instance < HW_SPI_INSTANCE_COUNT);

    uint32_t temp;

    /* these settings are only relevant in master mode*/
    if (HW_SPI_MCR(instance).B.MSTR == 1)
    {
        temp = HW_SPI_CTARn_RD(instance, whichCtar); /* save register contents*/
        temp &= ~(BM_SPI_CTARn_DBR | BM_SPI_CTARn_PBR | BM_SPI_CTARn_BR); /* clear dividers*/
        temp |= BF_SPI_CTARn_DBR(divisors->doubleBaudRate) |
                BF_SPI_CTARn_PBR(divisors->prescaleDivisor) |
                BF_SPI_CTARn_BR(divisors->baudRateDivisor);
        HW_SPI_CTARn_WR(instance, whichCtar, temp);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : dspi_hal_configure_pcs_polarity
 * Description   : Configure DSPI peripheral chip select polarity.
 * This function will take in the desired peripheral chip select (PCS) and it's
 * corresponding desired polarity and will configure the PCS signal to operate with the
 * desired characteristic.
 *
 *END**************************************************************************/
void dspi_hal_configure_pcs_polarity(uint32_t instance, dspi_which_pcs_config_t pcs,
                                     dspi_pcs_polarity_config_t activeLowOrHigh)
{
    assert(instance < HW_SPI_INSTANCE_COUNT);

    uint32_t temp;

    temp = BR_SPI_MCR_PCSIS(instance);

    if (activeLowOrHigh == kDspiPcs_ActiveLow)
    {
        temp |= pcs;
    }
    else  /* kDspiPcsPolarity_ActiveHigh*/
    {
        temp &= ~(unsigned)pcs;
    }

    BW_SPI_MCR_PCSIS(instance, temp);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : dspi_hal_configure_fifos
 * Description   : Configure DSPI fifos.
 * This function with allow the caller to disable/enable the TX and RX FIFOs (independently).
 * Note that to disable, the caller must pass in a logic 1 (true) for the particular FIFO
 * configuration.  To enable, the caller must pass in a logic 0 (false).  For example, to enable
 * both the TX and RX FIFOs, the caller will make this function call (where instance is the
 *
 *END**************************************************************************/
void dspi_hal_configure_fifos(uint32_t instance, bool disableTxFifo, bool disableRxFifo)
{
    assert(instance < HW_SPI_INSTANCE_COUNT);

