maoravni/Dev/FECDEV/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/hal/dspi/fsl_dspi_hal.c
    /* first see if MDIS is set or cleared */
    uint32_t isMdisSet = HW_SPI_MCR(instance).B.MDIS;

    if (isMdisSet)
    {
        /* clear the MDIS bit to allow us to write to the fifo disables */
        HW_SPI_MCR_CLR(instance, BM_SPI_MCR_MDIS);
    }

    BW_SPI_MCR_DIS_TXF(instance, (disableTxFifo == true));
    BW_SPI_MCR_DIS_RXF(instance, (disableRxFifo == true));

    /* set MDIS if it was set to begin with */
    if (isMdisSet)
    {
        HW_SPI_MCR_SET(instance, BM_SPI_MCR_MDIS);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : dspi_hal_flush_fifos
 * Description   : Flush DSPI fifos.
 *
 *END**************************************************************************/
void dspi_hal_flush_fifos(uint32_t instance, bool enableFlushTxFifo, bool enableFlushRxFifo)
{
    assert(instance < HW_SPI_INSTANCE_COUNT);

    BW_SPI_MCR_CLR_TXF(instance, (enableFlushTxFifo == true));
    BW_SPI_MCR_CLR_RXF(instance, (enableFlushRxFifo == true));
}

/*FUNCTION**********************************************************************
 *
 * Function Name : dspi_hal_configure_data_format
 * Description   : Configure the data format for a particular CTAR.
 * This function configures the bits-per-frame, polarity, phase, and shift direction for a
 * particular CTAR. An example use case is as follows:
 *    dspi_data_format_config_t dataFormat;
 *    dataFormat.bitsPerFrame = 16;
 *    dataFormat.clkPolarity = kDspiClockPolarity_ActiveLow;
 *    dataFormat.clkPhase = kDspiClockPhase_FirstEdge;
 *    dataFormat.direction = kDspiMsbFirst;
 *    dspi_hal_configure_data_format(instance, kDspiCtar0, &dataFormat);
 *
 *END**************************************************************************/
dspi_status_t dspi_hal_configure_data_format(uint32_t instance,
                                        dspi_ctar_selection_t whichCtar,
                                        const dspi_data_format_config_t * config)
{
    assert(instance < HW_SPI_INSTANCE_COUNT);

    /* check bits-per-frame value to make sure it it within the proper range*/
    /* in either master or slave mode*/
    if ((config->bitsPerFrame < 4) ||
        ((config->bitsPerFrame > 16) && (HW_SPI_MCR(instance).B.MSTR == 1)) ||
        ((config->bitsPerFrame > 32) && (HW_SPI_MCR(instance).B.MSTR == 0)))
    {
        return kStatus_DSPI_InvalidBitCount;
    }

    uint32_t temp;

    /* for master mode configuration*/
    if (HW_SPI_MCR(instance).B.MSTR == 1)
    {
        temp = HW_SPI_CTARn_RD(instance, whichCtar); /* save register contents*/
        temp &= ~(BM_SPI_CTARn_FMSZ| BM_SPI_CTARn_CPOL | BM_SPI_CTARn_CPHA | BM_SPI_CTARn_LSBFE);
        temp |= BF_SPI_CTARn_FMSZ(config->bitsPerFrame - 1) |
                BF_SPI_CTARn_CPOL(config->clkPolarity) |
                BF_SPI_CTARn_CPHA(config->clkPhase) |
                BF_SPI_CTARn_LSBFE(config->direction);
        HW_SPI_CTARn_WR(instance, whichCtar, temp);
    }
    else /* for slave mode configuration*/
    {
        temp = HW_SPI_CTARn_SLAVE_RD(instance, whichCtar); /* save register contents*/
        temp &= ~(BM_SPI_CTARn_SLAVE_FMSZ| BM_SPI_CTARn_SLAVE_CPOL | BM_SPI_CTARn_SLAVE_CPHA);
        temp |= BF_SPI_CTARn_SLAVE_FMSZ(config->bitsPerFrame - 1) |
                BF_SPI_CTARn_SLAVE_CPOL(config->clkPolarity) |
                BF_SPI_CTARn_SLAVE_CPHA(config->clkPhase);
        HW_SPI_CTARn_SLAVE_WR(instance, whichCtar, temp);
    }
    return kStatus_DSPI_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : dspi_hal_configure_delays
 * Description   : Configure the delays for a particular CTAR, master mode only.
 * This function configures the PCS to SCK delay prescalar (PCSSCK),
 * the PCS to SCK Delay scalar (CSSCK),
 * the After SCK delay prescalar (PASC),
 * the After SCK delay scalar (ASC),
 * the Delay after transfer prescalar (PDT),
 * and the Delay after transfer scalar (DT).
 * The following is an example use case of this function:
 *    dspi_delay_settings_config_t delayConfig;
 *    delayConfig.pcsToSckPre = 0x3;
 *    delayConfig.pcsToSck = 0xF;
 *    delayConfig.afterSckPre = 0x2;
 *    delayConfig.afterSck = 0xA;
 *    delayConfig.afterTransferPre = 0x1;
 *    delayConfig.afterTransfer = 0x5;
 *    dspi_hal_configure_delays(instance, kDspiCtar0, &delayConfig);
 *
 *END**************************************************************************/
void dspi_hal_configure_delays(uint32_t instance,
                               dspi_ctar_selection_t whichCtar,
                               const dspi_delay_settings_config_t * config)
{
    assert(instance < HW_SPI_INSTANCE_COUNT);

    uint32_t temp;

    /* these settings are only relevant in master mode*/
    if (HW_SPI_MCR(instance).B.MSTR == 1)
    {
        temp = HW_SPI_CTARn_RD(instance, whichCtar); /* save register contents*/
        temp &= ~(BM_SPI_CTARn_PCSSCK | BM_SPI_CTARn_PASC | BM_SPI_CTARn_PDT |
                  BM_SPI_CTARn_CSSCK| BM_SPI_CTARn_ASC | BM_SPI_CTARn_DT);
        temp |= BF_SPI_CTARn_PCSSCK(config->pcsToSckPre) |
                BF_SPI_CTARn_PASC(config->afterSckPre) |
                BF_SPI_CTARn_PDT(config->afterTransferPre) |
                BF_SPI_CTARn_CSSCK(config->pcsToSck) |
                BF_SPI_CTARn_ASC(config->afterSck) |
                BF_SPI_CTARn_DT(config->afterTransfer);
        HW_SPI_CTARn_WR(instance, whichCtar, temp);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : dspi_hal_configure_dma
 * Description   : Configure transmit and receive DMA requests.
 * This function configures the FIFOs to generate a DMA or interrupt request. Note that the
 * corresponding request enable must also be set.  For the Transmit FIFO Fill, in order
 * to generate a DMA request, the Transmit FIFO Fill Request Enable (TFFF_RE) must also be set.
 * Similarly for the Receive FIFO Drain Request, to generate a DMA request, the Receive FIFO Drain
 * Request Enable (RFDF_RE) must also be set.  These request enables can be configured via
 * the function dspi_hal_configure_interrupt().  So basically to enable DMA operation, first enable
 * the desired request enable using the dspi_hal_configure_interrupt() function and then use
 * the dspi_hal_configure_dma() to configure the request to generate a DMA reuqest.
 *
 *END**************************************************************************/
void dspi_hal_configure_dma(uint32_t instance, bool enableTransmit, bool enableReceive)
{
    assert(instance < HW_SPI_INSTANCE_COUNT);

    BW_SPI_RSER_TFFF_DIRS(instance, enableTransmit);
    BW_SPI_RSER_RFDF_DIRS(instance, enableReceive);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : dspi_hal_configure_interrupt
 * Description   : Configure DSPI interrupts.
 * This function will configure the various interrupt sources of the DSPI.  The parameters to pass
 * in are instance, interrupt source, and enable/disable setting.
 * The interrupt source will be of a typedef enum whose value will be the bit position of the
 * interrupt source setting within the RSER register.  In the DSPI, all of the interrupt
 * configuration settings reside within the one register.  The typedef enum will equate each
 * interrupt source to the bit position defined in the device header file.
 * The function will use these bit positions in its algorithm to enable/disable the
 * interrupt source, where interrupt source is of type dspi_status_and_interrupt_request_t.
 *    temp = (HW_SPI_RSER_RD(instance) & ~interruptSrc) | (enable << interruptSrc);
 *    HW_SPI_RSER_WR(instance, temp);
 *
 *    dspi_hal_configure_interrupt(instance, kDspiTxComplete, true); <- example use-case
 *
 *END**************************************************************************/
void dspi_hal_configure_interrupt(uint32_t instance,
                                  dspi_status_and_interrupt_request_t interruptSrc,
                                  bool enable)
{
    assert(instance < HW_SPI_INSTANCE_COUNT);

    uint32_t temp;

    temp = (HW_SPI_RSER_RD(instance) & ~(0x1U << interruptSrc)) | ((uint32_t)enable << interruptSrc);
    HW_SPI_RSER_WR(instance, temp);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : dspi_hal_get_fifo_data
 * Description   : Read fifo registers for debug purposes.
 *
 *END**************************************************************************/
uint32_t dspi_hal_get_fifo_data(uint32_t instance, dspi_fifo_t whichFifo, uint32_t whichFifoEntry)
{
    assert(instance < HW_SPI_INSTANCE_COUNT);

    if (whichFifo == kDspiTxFifo)
    {
        return HW_SPI_TXFRn_RD(instance, whichFifoEntry);
    }
    else
    {
        return HW_SPI_RXFRn_RD(instance, whichFifoEntry);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : dspi_hal_write_data_master_mode
 * Description   : Write data into the data buffer, master mode.
 * In master mode, the 16-bit data is appended with the 16-bit command info. The command portion
 * provides characteristics of the data being sent such as: optional continuous chip select
 * operation between transfers, the desired Clock and Transfer Attributes register to use for the
 * associated SPI frame, the desired PCS signal to use for the data transfer, whether the current
 * transfer is the last in the queue, and whether to clear the transfer count (normally needed when
 * sending the first frame of a data packet). An example use case is as follows:
 *    dspi_command_config_t commandConfig;
 *    commandConfig.isChipSelectContinuous = true;
 *    commandConfig.whichCtar = kDspiCtar0;
 *    commandConfig.whichPcs = kDspiPcs1;
 *    commandConfig.clearTransferCount = false;
 *    commandConfig.isEndOfQueue = false;
 *    dspi_hal_write_data_master_mode(instance, &commandConfig, dataWord);
 *
 *END**************************************************************************/
void dspi_hal_write_data_master_mode(uint32_t instance,
                                     dspi_command_config_t * command,
                                     uint16_t data)
{
    assert(instance < HW_SPI_INSTANCE_COUNT);

    uint32_t temp;

    temp = BF_SPI_PUSHR_CONT(command->isChipSelectContinuous) |
           BF_SPI_PUSHR_CTAS(command->whichCtar) |
           BF_SPI_PUSHR_PCS(command->whichPcs) |
           BF_SPI_PUSHR_EOQ(command->isEndOfQueue) |
           BF_SPI_PUSHR_CTCNT(command->clearTransferCount) |
           BF_SPI_PUSHR_TXDATA(data);

    HW_SPI_PUSHR_WR(instance, temp);
}

/*******************************************************************************
 * EOF
 ******************************************************************************/

